'use strict'

/**
 * Ресурсы, для которых предназначаются шаблоны отчетов.
 */
module.exports = {
  /**
   * Дело о земельном участке.
   */
  steadFile: 10,
  /**
   * Заявление об аннулировании разрешения на установку и эксплуатацию рекламной конструкции.
   */
  adConstructionAnnulmentRequest: 20,
  /**
   * Заявление на разрешение на установку рекламной конструкции.
   */
  adConstructionAllowanceRequest: 30,
  /**
   * Книга предоставления сведений.
   */
  infoProvidingBook: 40,
  /**
   * Книга регистрации документов.
   */
  registrationBook: 50,
  /**
   * Книга учёта заявок.
   */
  requestsAccountingBook: 60,
  /**
   * Книга учёта сведений.
   */
  infoAccountingBook: 70,
  /**
   * Книга хранения.
   */
  storageBook: 80,
  /**
   * Модуль АС "Градостроительное зонирование".
   */
  urbanZoning: 90,
  /**
   * Модуль АС "Планировка территорий".
   */
  urbanPlanning: 100,
  /**
   * Модуль СР "Объекты капитального строительства".
   */
  oks: 110,
  /**
   * Отказ в аннулировании разрешения на установку и эксплуатацию рекламной конструкции.
   */
  adConstructionAnnulmentUnapprovement: 120,
  /**
   * Отказ в разрешении на установку и эксплуатацию рекламной конструкции.
   */
  adConstructionUnapprovement: 130,
  /**
   * Предписание о демонтаже рекламной конструкции.
   */
  adConstructionDismantlingOrder: 140,
  /**
   * Пространственные данные (ПД).
   */
  spatialData: 150,
  /**
   * Разрешение на установку и эксплуатацию рекламной конструкции.
   */
  /**
   * Распоряжение об аннулировании разрешения на установку и эксплуатацию рекламной конструкции.
   */
  adConstructionAnnulmentOrder: 170,
  /**
   * Реестр Дел о земельных участках.
   */
  steadFilesRegistry: 180,
  /**
   * Реестр книг.
   */
  booksRegistry: 190,
  /**
   * Реестр томов.
   */
  volumesRegistry: 200,
  /**
   * Адресный реестр.
   */
  addressRegistry: 210,
  /**
   * Лист согласования.
   */
  agreementsSheet: 220,
  /**
   * Реестр заявок ТП.
   */
  terrPlanRequestsRegistry: 230,
  /**
   * Заявки Росреестра.
   */
  rosreestrRegistry: 240,
  /**
   * Заявки Росреестра.
   */
  inventarizationResultRegistry: 250,
  /**
   * Реестр документов.
   */
  documentRegistry: 260,
  /**
   * Реестры ПД.
   */
  spatialRegistry: 270,
  /**
   * Календарь событий.
   */
  eventsCalendar: 280,
  /**
   * Справочник ролей.
   */
  roleGuide: 290,
  /**
   * Справочник пользователей.
   */
  userRegistry: 300
}
