'use strict'

/**
 * Действия в системе.
 */
module.exports = {
  /**
   * Аутентификация.
   */
  authentificate: 10,

  /**
   * Восстановление удаленного объекта.
   */
  restore: 20,

  /**
   * Экспорт файла.
   */
  fileExport: 30,

  /**
   * Закрытие.
   */
  close: 40,

  /**
   * Редактирование объекта.
   */
  edit: 50,

  /**
   * Связывание объекта.
   */
  link: 55,

  /**
   * Создание объекта.
   */
  add: 60,

  /**
   * Удаление объекта.
   */
  delete: 70,

  /**
   * Вход.
   */
  enter: 80,

  /**
   * Выход из системы.
   */
  logout: 90,

  /**
   * Автоматиз. загрузка.
   */
  аutomatedDownload: 100,

  /**
   * Автоматиз. загрузка.Создание объекта
   */
  аutomatedDownloadCreateObject: 110
}
